# Pandas

In [1]:
import pandas as pd

In [2]:
dataframe = pd.read_csv("./Data/personas.csv")

In [3]:
dataframe

    NOMBRE          APELLIDOS  EDAD  SALARIO
0  ANTONIO        PEREZ GOMEZ    34    20000
1     LUIS  RODRIGUEZ VAZQUEZ    45    45000
2     ROSA     MARTINEZ LOPEZ    25    15000
3    PEDRO     SILVA GONZALEZ    54    50000
4    MARIA         DIAZ LOPEZ    40    32000

In [4]:
dataframe.describe()

            EDAD       SALARIO
count   5.000000      5.000000
mean   39.600000  32400.000000
std    10.968136  15208.550227
min    25.000000  15000.000000
25%    34.000000  20000.000000
50%    40.000000  32000.000000
75%    45.000000  45000.000000
max    54.000000  50000.000000

In [5]:
dataframe["NOMBRE"]

0    ANTONIO
1       LUIS
2       ROSA
3      PEDRO
4      MARIA
Name: NOMBRE, dtype: object

In [6]:
dataframe["NOMBRE"][0]

'ANTONIO'

In [7]:
dataframe[["NOMBRE","APELLIDOS"]]

    NOMBRE          APELLIDOS
0  ANTONIO        PEREZ GOMEZ
1     LUIS  RODRIGUEZ VAZQUEZ
2     ROSA     MARTINEZ LOPEZ
3    PEDRO     SILVA GONZALEZ
4    MARIA         DIAZ LOPEZ

In [8]:
dataframe

    NOMBRE          APELLIDOS  EDAD  SALARIO
0  ANTONIO        PEREZ GOMEZ    34    20000
1     LUIS  RODRIGUEZ VAZQUEZ    45    45000
2     ROSA     MARTINEZ LOPEZ    25    15000
3    PEDRO     SILVA GONZALEZ    54    50000
4    MARIA         DIAZ LOPEZ    40    32000

In [9]:
dataframe["SALARIO"] > 30000

0    False
1     True
2    False
3     True
4     True
Name: SALARIO, dtype: bool

In [10]:
filtro = dataframe["SALARIO"] > 30000

In [11]:
dataframe2 = dataframe[filtro]

In [12]:
dataframe2

  NOMBRE          APELLIDOS  EDAD  SALARIO
1   LUIS  RODRIGUEZ VAZQUEZ    45    45000
3  PEDRO     SILVA GONZALEZ    54    50000
4  MARIA         DIAZ LOPEZ    40    32000

In [13]:
dataframe2.values

array([['LUIS', 'RODRIGUEZ VAZQUEZ', 45, 45000],
       ['PEDRO', 'SILVA GONZALEZ', 54, 50000],
       ['MARIA', 'DIAZ LOPEZ', 40, 32000]], dtype=object)

In [14]:
array = dataframe2.values

In [15]:
array

array([['LUIS', 'RODRIGUEZ VAZQUEZ', 45, 45000],
       ['PEDRO', 'SILVA GONZALEZ', 54, 50000],
       ['MARIA', 'DIAZ LOPEZ', 40, 32000]], dtype=object)

In [16]:
array[0,1]

'RODRIGUEZ VAZQUEZ'